mysensors/MySensors/hal/architecture/STM32/MyHwSTM32.cpp
/*
 * The MySensors Arduino library handles the wireless radio link and protocol
 * between your home built sensors/actuators and HA controller of choice.
 * The sensors forms a self healing radio network with optional repeaters. Each
 * repeater and gateway builds a routing tables in EEPROM which keeps track of the
 * network topology allowing messages to be routed to nodes.
 *
 * Created by Henrik Ekblad <henrik.ekblad@mysensors.org>
 * Copyright (C) 2013-2026 Sensnology AB
 * Full contributor list: https://github.com/mysensors/MySensors/graphs/contributors
 *
 * Documentation: http://www.mysensors.org
 * Support Forum: http://forum.mysensors.org
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * version 2 as published by the Free Software Foundation.
 */

/**
 * @file MyHwSTM32.cpp
 * @brief Hardware abstraction layer for STM32 microcontrollers using STM32duino core
 *
 * This implementation uses the official STM32duino Arduino core which provides
 * STM32Cube HAL underneath. It supports a wide range of STM32 families.
 *
 * Tested on:
 * - STM32F103C8 Blue Pill
 * - STM32F401CC/CE Black Pill
 * - STM32F411CE Black Pill
 *
 * Pin Mapping Example (STM32F4 Black Pill):
 *
 * nRF24L01+ Radio (SPI1):
 * - SCK:  PA5
 * - MISO: PA6
 * - MOSI: PA7
 * - CSN:  PA4
 * - CE:   PB0 (configurable via MY_RF24_CE_PIN)
 *
 * RFM69/RFM95 Radio (SPI1):
 * - SCK:  PA5
 * - MISO: PA6
 * - MOSI: PA7
 * - CS:   PA4
 * - IRQ:  PA3 (configurable)
 * - RST:  PA2 (configurable)
 */

#include "MyHwSTM32.h"

// Sleep mode state variables
static volatile uint8_t _wokeUpByInterrupt = INVALID_INTERRUPT_NUM;
static volatile uint8_t _wakeUp1Interrupt = INVALID_INTERRUPT_NUM;
static volatile uint8_t _wakeUp2Interrupt = INVALID_INTERRUPT_NUM;
static uint32_t sleepRemainingMs = 0ul;

// RTC handle for wake-up timer
static RTC_HandleTypeDef hrtc = {0};
static bool rtcInitialized = false;

// Forward declarations for sleep helper functions
static bool hwSleepInit(void);
static bool hwSleepConfigureTimer(uint32_t ms);
static void hwSleepRestoreSystemClock(void);
static void wakeUp1ISR(void);
static void wakeUp2ISR(void);

// Forward declarations for RTC counter helpers (portable across F1 and modern)
static uint32_t hwRtcGetCounter(void);

/**
 * @brief Prevent HAL_RTC_Init from re-running clock setup
 * All clock and backup domain configuration is handled in hwSleepInit()
 */
extern "C" void HAL_RTC_MspInit(RTC_HandleTypeDef *hrtc_param)
{
	(void)hrtc_param;
}

bool hwInit(void)
{
#if !defined(MY_DISABLED_SERIAL)
	MY_SERIALDEVICE.begin(MY_BAUD_RATE);
#if defined(MY_GATEWAY_SERIAL)
	// Wait for serial port to connect (needed for native USB)
	while (!MY_SERIALDEVICE) {
		; // Wait for serial port connection
	}
#endif
#endif

	// STM32duino EEPROM library auto-initializes on first use
	// No explicit initialization required
	return true;
}

void hwReadConfigBlock(void *buf, void *addr, size_t length)
{
	uint8_t *dst = static_cast<uint8_t *>(buf);
	const intptr_t pos = reinterpret_cast<intptr_t>(addr);

	for (size_t i = 0; i < length; i++) {
		dst[i] = EEPROM.read(pos + i);
	}
}

void hwWriteConfigBlock(void *buf, void *addr, size_t length)
{
	uint8_t *src = static_cast<uint8_t *>(buf);
	const intptr_t pos = reinterpret_cast<intptr_t>(addr);

	for (size_t i = 0; i < length; i++) {
		EEPROM.update(pos + i, src[i]);
	}
}

uint8_t hwReadConfig(const int addr)
{
	return EEPROM.read(addr);
}

void hwWriteConfig(const int addr, uint8_t value)
{
	EEPROM.update(addr, value);
}

void hwWatchdogReset(void)
{
#if defined(HAL_IWDG_MODULE_ENABLED) && defined(IWDG)
	// Reset independent watchdog if enabled
	IWDG->KR = IWDG_KEY_RELOAD;
#endif
}

void hwReboot(void)
{
	NVIC_SystemReset();
}

int32_t hwReadInternalTemp(void)
{
#if defined(ATEMP)
	// STM32duino defines ATEMP — use the easy path
	analogReadResolution(12);
	return (int32_t)analogRead(ATEMP);
#elif defined(STM32F1xx) && defined(ADC1)
	// STM32F1: ATEMP not defined in STM32duino, read ADC channel 16 directly
	// Temperature sensor is on ADC1_IN16, requires TSVREFE bit enabled

	// Enable ADC1 clock
	__HAL_RCC_ADC1_CLK_ENABLE();

	// Enable temperature sensor and VREFINT (TSVREFE bit in CR2)
	ADC1->CR2 |= ADC_CR2_TSVREFE;

	// Wait for sensor startup (~10 µs per datasheet)
	delayMicroseconds(20);

	// Configure channel 16, sample time = 239.5 cycles (longest, for accuracy)
	// SMP16 is bits [23:21] in SMPR1, value 0b111 = 239.5 cycles
	ADC1->SMPR1 |= (0x7UL << 18);  // SMP16 = 239.5 cycles

	// Set sequence: 1 conversion, channel 16
	ADC1->SQR3 = 16;   // First conversion = channel 16
	ADC1->SQR1 = 0;    // 1 conversion in sequence

	// Ensure ADC is on
	ADC1->CR2 |= ADC_CR2_ADON;
	delayMicroseconds(2);

	// Start conversion
	ADC1->CR2 |= ADC_CR2_ADON;  // Second write starts conversion on F1

	// Wait for conversion complete (EOC flag)
	uint32_t timeout = 100000;
	while (((ADC1->SR & ADC_SR_EOC) == 0) && (timeout > 0)) {
		timeout--;
	}

	if (timeout == 0) {
		return -1;
	}

	int32_t raw = (int32_t)(ADC1->DR & 0x0FFF);

	// Disable temperature sensor to save power
	ADC1->CR2 &= ~ADC_CR2_TSVREFE;

	return raw;
#else
	return -1;
#endif
}


void hwRandomNumberInit(void)
{
#if defined(HAL_RNG_MODULE_ENABLED) && defined(RNG)
	// ============================================================
	// Hardware RNG available (F2, F4x5/F4x7+, F7, L4, G0, G4, H7)
	// ============================================================
	__HAL_RCC_RNG_CLK_ENABLE();

	RNG_HandleTypeDef hrng = {0};
	hrng.Instance = RNG;

	if (HAL_RNG_Init(&hrng) == HAL_OK) {
		uint32_t seed = 0;
		if (HAL_RNG_GenerateRandomNumber(&hrng, &seed) == HAL_OK) {
			randomSeed(seed);
			// Disable RNG clock to save power after seeding
			HAL_RNG_DeInit(&hrng);
			__HAL_RCC_RNG_CLK_DISABLE();
			return;
		}
		HAL_RNG_DeInit(&hrng);
	}
	__HAL_RCC_RNG_CLK_DISABLE();
	// Fall through to software entropy if hardware RNG failed

#endif // HAL_RNG_MODULE_ENABLED && RNG

