mysensors/MySensors/hal/architecture/STM32/MyHwSTM32.cpp
	// ============================================================
	// Software entropy fallback (F0, F1, F3, and chips without RNG)
	// Uses ADC noise from temp sensor, VREFINT, and timing jitter
	// ============================================================

#if defined(ADC1)
	uint32_t seed = 0;

	for (uint8_t i = 0; i < 32; i++) {
		uint32_t value = hwReadInternalTemp();

#if defined(AVREF)
		value ^= analogRead(AVREF);
#endif

		value ^= micros();

		// Rotate and XOR for better bit distribution
		seed ^= (i == 0) ? value : ((value << i) | (value >> (32 - i)));

		delayMicroseconds(100);
	}

	randomSeed(seed);
#else
	// Last resort: weak entropy from timing only
	randomSeed(hwMillis() ^ (micros() << 16));
#endif // ADC1
}

bool hwUniqueID(unique_id_t *uniqueID)
{
#if defined(UID_BASE)
	(void)memset(reinterpret_cast<uint8_t *>(uniqueID), MY_HWID_PADDING_BYTE, sizeof(unique_id_t));
	(void)memcpy(reinterpret_cast<uint8_t *>(uniqueID), (const uint8_t *)UID_BASE, 12);
	return true;
#else
	return false;
#endif
}

uint16_t hwCPUVoltage(void)
{
	// For STM32WL, STM32U0 and others that define helper macro
#if defined(__HAL_ADC_CALC_VREFANALOG_VOLTAGE)
	analogReadResolution(12);
	uint32_t vrefint = analogRead(AVREF);
	return (uint16_t) __HAL_ADC_CALC_VREFANALOG_VOLTAGE(vrefint, LL_ADC_RESOLUTION_12B);
#else
#if defined(AVREF) && defined(__HAL_RCC_ADC1_CLK_ENABLE)
	// Force 12-bit resolution for predictable raw values
	analogReadResolution(12);
	uint32_t vrefint = analogRead(AVREF);

	if (vrefint > 0) {
#if defined(VREFINT_CAL_ADDR) && defined(VREFINT_CAL_VREF)
		// Use factory calibration for accurate measurement
		// VREFINT_CAL was measured at VREFINT_CAL_VREF mV with 12-bit ADC
		uint16_t vrefint_cal = *((uint16_t *)VREFINT_CAL_ADDR);
		return (uint16_t)((uint32_t)VREFINT_CAL_VREF * vrefint_cal / vrefint);
#else
		// No factory calibration (e.g., STM32F103)
		// Assume typical VREFINT = 1.2V, 12-bit ADC
		return (uint16_t)((1200UL * 4095UL) / vrefint);
#endif
	}
#endif // AVREF and __HAL_RCC . . .
#endif // __HAL_ADC_CALC_VREFANALOG_VOLTAGE

	return 3300;
}

uint16_t hwCPUFrequency(void)
{
	// HAL_RCC_GetSysClockFreq() reads the actual clock configuration registers
	// and returns the current SYSCLK frequency in Hz
	return (uint16_t)(HAL_RCC_GetSysClockFreq() / 100000UL);
}

int8_t hwCPUTemperature(void)
{
#if defined(__HAL_ADC_CALC_TEMPERATURE) // Use helper macro for STM32WL and some others
	int32_t VRef = hwCPUVoltage();
	return (int8_t) __HAL_ADC_CALC_TEMPERATURE(VRef, analogRead(ATEMP), LL_ADC_RESOLUTION_12B );
#else

	// cppcheck-suppress knownConditionTrueFalse
	int32_t temp_raw = hwReadInternalTemp();

	if (temp_raw < 0) { // cppcheck-suppress knownConditionTrueFalse
		return FUNCTION_NOT_SUPPORTED;
	}

#if defined(TEMP110_CAL_ADDR) && defined(TEMP30_CAL_ADDR)
	// Use factory calibration if available (STM32F4, L4, G4, etc.)
	uint16_t cal30 = *((uint16_t *)TEMP30_CAL_ADDR);
	uint16_t cal110 = *((uint16_t *)TEMP110_CAL_ADDR);

	if (cal110 != cal30) {
		int32_t temp = 30 + ((110 - 30) * (temp_raw - (int32_t)cal30)) /
		               ((int32_t)cal110 - (int32_t)cal30);

		temp = ((temp - MY_STM32_TEMPERATURE_OFFSET) * 100) / MY_STM32_TEMPERATURE_GAIN;
		return (int8_t)temp;
	}
#endif

	// Fallback: use typical datasheet values (no factory calibration)
#if defined(STM32F1xx)
	// STM32F1: V25 = 1.43V, slope = 4.3 mV/°C, slope is NEGATIVE (higher T = lower V)
	float voltage = (temp_raw * 3.3f) / 4096.0f;
	int32_t temp = 25 + (int32_t)((1.43f - voltage) / 0.0043f);
#else
	// STM32F4 and others without calibration: V25 = 0.76V, slope = 2.5 mV/°C
	float voltage = (temp_raw * 3.3f) / 4096.0f;
	int32_t temp = 25 + (int32_t)((voltage - 0.76f) / 0.0025f);
#endif

	return (int8_t)(((temp - MY_STM32_TEMPERATURE_OFFSET) * 100) / MY_STM32_TEMPERATURE_GAIN);
#endif // defined __HAL_ADC_CALC_TEMPERATURE
}

extern "C" caddr_t _sbrk(int incr);

uint16_t hwFreeMem(void)
{
	// Use ARM semihosting / newlib approach
	// _sbrk(0) returns current program break (top of heap)

	char stack_var;
	char *heap_end = (char *)_sbrk(0);

	if (heap_end != (char *)-1) {
		return (uint16_t)(&stack_var - heap_end);
	}

	return FUNCTION_NOT_SUPPORTED;
}

// ======================== RTC Counter Helpers ========================

/**
 * @brief Read current RTC counter value (portable)
 * @return 32-bit counter on F1, subsecond-approximated tick on modern STM32
 */
static uint32_t hwRtcGetCounter(void)
{
#if defined(STM32F1xx)
	return (uint32_t)(RTC->CNTL | (RTC->CNTH << 16));
#else
	// Modern STM32: use HAL to get time and compute seconds since epoch
	// For sleep remaining calculation, we only need relative elapsed seconds
	RTC_TimeTypeDef sTime = {0};
	HAL_RTC_GetTime(&hrtc, &sTime, RTC_FORMAT_BIN);
	// Must read date after time to unlock shadow registers
	RTC_DateTypeDef sDate = {0};
	HAL_RTC_GetDate(&hrtc, &sDate, RTC_FORMAT_BIN);
	return (uint32_t)(sTime.Hours * 3600 + sTime.Minutes * 60 + sTime.Seconds);
#endif
}

// ======================== Sleep Mode Helper Functions ========================

/**
 * @brief Initialize RTC for sleep wake-up timer
 * @return true if successful, false on error
 */
static bool hwSleepInit(void)
{
	if (rtcInitialized) {
		return true;
	}

	// ---- Enable PWR and backup domain access ----
#if defined(STM32F1xx)
	// STM32F1 requires BKP clock enabled BEFORE PWR clock
	__HAL_RCC_BKP_CLK_ENABLE();
	__DSB();
	__HAL_RCC_PWR_CLK_ENABLE();
	__DSB();

	// Dummy read to ensure clocks are active before accessing PWR registers
	volatile uint32_t dummy = RCC->APB1ENR;
	(void)dummy;

	// Direct register write for backup domain access
	PWR->CR |= PWR_CR_DBP;
	__DSB();
#else
	// Modern STM32 (F2/F3/F4/F7/L0/L1/L4/L5/G0/G4/H7)
#if !defined(STM32WLxx)
	__HAL_RCC_PWR_CLK_ENABLE(); // N/A for STM32WL. Clock is alway on.
#endif // !STM32WLxx
	HAL_PWR_EnableBkUpAccess();
#endif

	// ---- Reset backup domain if RTC not already configured ----
	if ((RCC->BDCR & RCC_BDCR_RTCEN) == 0) {
		__HAL_RCC_BACKUPRESET_FORCE();
		HAL_Delay(10);
		__HAL_RCC_BACKUPRESET_RELEASE();
		HAL_Delay(10);
	}

	// ---- Select RTC clock source: try LSE, fall back to LSI ----
	bool useLSE = false;
#ifdef STM32WLxx
	/* Check if LSE is ready */
	if (__HAL_RCC_GET_FLAG(RCC_FLAG_LSERDY)) {
		useLSE = true;
	} else {
		/* Check if LSI is ready */
		if (__HAL_RCC_GET_FLAG(RCC_FLAG_LSIRDY)) {
			useLSE = false;
		} else {
			// Neither ready — try enabling LSI as fallback
			__HAL_RCC_LSI_ENABLE();
			uint32_t timeout = 1000000;
			while (!__HAL_RCC_GET_FLAG(RCC_FLAG_LSIRDY) && (timeout > 0)) {
				timeout--;
			}
			if (timeout == 0) {
				return false;
			}
			useLSE = false;
		}
	}
#else
	if ((RCC->BDCR & RCC_BDCR_LSERDY) != 0) {
		useLSE = true;
	} else {
		RCC->BDCR |= RCC_BDCR_LSEON;
		uint32_t timeout = 2000000;
		while (((RCC->BDCR & RCC_BDCR_LSERDY) == 0) && (timeout > 0)) {
			timeout--;
		}

		if (timeout > 0) {
			useLSE = true;
		} else {
			RCC->BDCR &= ~RCC_BDCR_LSEON;  // Disable failed LSE

			if ((RCC->CSR & RCC_CSR_LSIRDY) == 0) {
				RCC->CSR |= RCC_CSR_LSION;
				timeout = 1000000;
				while (((RCC->CSR & RCC_CSR_LSIRDY) == 0) && (timeout > 0)) {
					timeout--;
				}
				if (timeout == 0) {
					return false;  // Both LSE and LSI failed
				}
			}
		}
	}
#endif
	// ---- Configure RTC clock source ----
#ifdef STM32WLxx
	RCC_PeriphCLKInitTypeDef  periphClk = {0};
	periphClk.PeriphClockSelection = RCC_PERIPHCLK_RTC;
	periphClk.RTCClockSelection    = useLSE ? RCC_RTCCLKSOURCE_LSE :  RCC_RTCCLKSOURCE_LSI;
	if (HAL_RCCEx_PeriphCLKConfig(&periphClk) != HAL_OK) {
		return false;
	}

	/* ---- Enable the RTC peripheral clock ---- */
	__HAL_RCC_RTC_ENABLE();
	__HAL_RCC_RTCAPB_CLK_ENABLE();

#else
	uint32_t currentRtcSel = (RCC->BDCR & RCC_BDCR_RTCSEL);
	uint32_t desiredRtcSel = useLSE ? RCC_BDCR_RTCSEL_0 : RCC_BDCR_RTCSEL_1;

