mysensors/MySensors/hal/architecture/STM32/MyHwSTM32.cpp
	if (currentRtcSel != desiredRtcSel) {
		// Changing RTCSEL requires backup domain reset on most STM32 families
		__HAL_RCC_BACKUPRESET_FORCE();
		__HAL_RCC_BACKUPRESET_RELEASE();
		RCC->BDCR |= desiredRtcSel;
	}
	RCC->BDCR |= RCC_BDCR_RTCEN;
#endif
	// ---- Initialize RTC peripheral ----
	hrtc.Instance = RTC;

#if defined(STM32F1xx)
	// ============================================================
	// STM32F1: Legacy RTC with counter-based architecture
	// ============================================================

	if (useLSE) {
		hrtc.Init.AsynchPrediv = 32767;  // 32768 Hz / 32768 = 1 Hz
	} else {
		hrtc.Init.AsynchPrediv = 39999;  // ~40 kHz / 40000 = 1 Hz (F1 LSI is ~40 kHz)
	}

	hrtc.Init.OutPut = RTC_OUTPUTSOURCE_NONE;

	if (HAL_RTC_Init(&hrtc) != HAL_OK) {
		return false;
	}

	// Clear any stale alarm flags before enabling interrupts
	RTC->CRL &= ~RTC_CRL_ALRF;
	EXTI->PR = EXTI_PR_PR17;
	NVIC_ClearPendingIRQ(RTC_Alarm_IRQn);

	HAL_NVIC_SetPriority(RTC_Alarm_IRQn, 0, 0);
	HAL_NVIC_EnableIRQ(RTC_Alarm_IRQn);

#elif defined(STM32U0xx)
	// ============================================================
	// STM32U0: Modern RTC with ICSR register (instead of ISR)
	// ============================================================
	// Similar to other modern STM32 families but with renamed registers
	// and combined RTC/TAMP interrupt vector

	hrtc.Init.HourFormat = RTC_HOURFORMAT_24;

	if (useLSE) {
		hrtc.Init.AsynchPrediv = 127;  // 128
		hrtc.Init.SynchPrediv  = 255;  // 256, total = 32768
	} else {
		hrtc.Init.AsynchPrediv = 127;
		hrtc.Init.SynchPrediv  = 249;  // Adjusted for typical ~32 kHz LSI
	}

	hrtc.Init.OutPut         = RTC_OUTPUT_DISABLE;
	hrtc.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
	hrtc.Init.OutPutType     = RTC_OUTPUT_TYPE_OPENDRAIN;

	// Check if RTC is already initialized (avoid reinit conflicts with SPI etc.)
	if ((RTC->ICSR & RTC_ICSR_INITS) == 0) {
		if (HAL_RTC_Init(&hrtc) != HAL_OK) {
			return false;
		}
	} else {
		hrtc.State = HAL_RTC_STATE_READY;
	}

	// Configure interrupt for RTC wake_up timer
	HAL_NVIC_SetPriority(RTC_TAMP_IRQn, 0, 0);
	HAL_NVIC_EnableIRQ(RTC_TAMP_IRQn);
#elif defined(STM32WLxx)
	hrtc.Init.HourFormat     = RTC_HOURFORMAT_24;

	/* Select prescaler values based on clock source */
	if (useLSE) {
		hrtc.Init.AsynchPrediv   = 127;        /* 32768 / 128 = 256 Hz        */
		hrtc.Init.SynchPrediv    = 255;        /* 256 / 256   = 1 Hz calendar */
	} else {
		hrtc.Init.AsynchPrediv   = 127;        /* 32000 / 128 = 250 Hz        */
		hrtc.Init.SynchPrediv    = 249;        /* 250 / 250   = 1 Hz calendar */
	}

	hrtc.Init.OutPut         = RTC_OUTPUT_DISABLE;
	hrtc.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
	hrtc.Init.OutPutType     = RTC_OUTPUT_TYPE_OPENDRAIN;
	hrtc.Init.OutPutRemap    = RTC_OUTPUT_REMAP_NONE;
	hrtc.Init.OutPutPullUp   = RTC_OUTPUT_PULLUP_NONE;
	hrtc.Init.BinMode        = RTC_BINARY_NONE;
	if ((RTC->ICSR & RTC_ICSR_INITS) == 0) {
		if (HAL_RTC_Init(&hrtc) != HAL_OK) {
			return false;
		}
	} else {
		hrtc.State = HAL_RTC_STATE_READY;
	}

	// Configure interrupt for RTC wake_up timer
#if defined(CORE_CM0PLUS) // Dual Core STM32WL
	HAL_NVIC_SetPriority(RTC_LSECSS_IRQn, 0, 0);
	HAL_NVIC_EnableIRQ(RTC_LSECSS_IRQn);
#else // Single Core STM32WL
	HAL_NVIC_SetPriority(RTC_WKUP_IRQn, 0, 0);
	HAL_NVIC_EnableIRQ(RTC_WKUP_IRQn);
#endif // CORE_CM0Plus

#else
	// ============================================================
	// STM32F2/F3/F4/F7/L1/L4/L5/G0/G4/H7: Modern RTC
	// ============================================================

	hrtc.Init.HourFormat = RTC_HOURFORMAT_24;

	if (useLSE) {
		hrtc.Init.AsynchPrediv = 127;   // 128
		hrtc.Init.SynchPrediv = 255;    // 256, total = 32768
	} else {
		hrtc.Init.AsynchPrediv = 127;
		hrtc.Init.SynchPrediv = 249;    // Adjusted for typical ~32 kHz LSI
	}

	hrtc.Init.OutPut = RTC_OUTPUT_DISABLE;
	hrtc.Init.OutPutPolarity = RTC_OUTPUT_POLARITY_HIGH;
	hrtc.Init.OutPutType = RTC_OUTPUT_TYPE_OPENDRAIN;

	// Check if RTC is already initialized (avoid reinit conflicts with SPI etc.)
	if ((RTC->ISR & RTC_ISR_INITS) == 0) {
		if (HAL_RTC_Init(&hrtc) != HAL_OK) {
			return false;
		}
	} else {
		hrtc.State = HAL_RTC_STATE_READY;
	}

	// Configure EXTI line 22 for RTC wake-up timer (required for STOP mode wake)
	// HAL_RTCEx_SetWakeUpTimer_IT handles this on most families, but be explicit
	HAL_NVIC_SetPriority(RTC_WKUP_IRQn, 0, 0);
	HAL_NVIC_EnableIRQ(RTC_WKUP_IRQn);

#endif // STM32F1xx

	rtcInitialized = true;
	return true;
}

/**
 * @brief Configure RTC wake-up timer for specified duration
 * @param ms Milliseconds to sleep (0 = disable timer)
 * @return true if successful, false on error
 */
static bool hwSleepConfigureTimer(uint32_t ms)
{
	if (!rtcInitialized) {
		return false;
	}

	if (ms == 0) {
#if defined(STM32F1xx)
		HAL_RTC_DeactivateAlarm(&hrtc, RTC_ALARM_A);
#else
		HAL_RTCEx_DeactivateWakeUpTimer(&hrtc);
#endif
		return true;
	}

#if defined(STM32F1xx)
	// ============================================================
	// STM32F1: Use RTC Alarm (counter-based)
	// ============================================================

	uint32_t currentCounter = hwRtcGetCounter();

	uint32_t seconds = ms / 1000;
	if (seconds == 0) {
		seconds = 1;  // Minimum 1 second
	}
	if (seconds > 0xFFFFFFFF - currentCounter) {
		seconds = 0xFFFFFFFF - currentCounter;
	}

	uint32_t alarmValue = currentCounter + seconds;

	// Write alarm registers directly via configuration mode
	while ((RTC->CRL & RTC_CRL_RTOFF) == 0) { }  // Wait for last write
	RTC->CRL |= RTC_CRL_CNF;                       // Enter config mode

	RTC->ALRH = (alarmValue >> 16) & 0xFFFF;
	RTC->ALRL = alarmValue & 0xFFFF;

	RTC->CRL &= ~RTC_CRL_CNF;                      // Exit config mode
	while ((RTC->CRL & RTC_CRL_RTOFF) == 0) { }    // Wait for write complete

	// Enable alarm interrupt in RTC
	RTC->CRH |= RTC_CRH_ALRIE;

#elif defined(STM32U0xx)  || defined(STM32WLxx)
	// ============================================================
	// STM32U0 & STM32WL: Use wake-up timer
	// ============================================================
	// STM32U0 HAL requires a 4th argument: WakeUpAutoClr (auto-clear of wakeup flag)

