mysensors/MySensors/hal/architecture/STM32/MyHwSTM32.cpp
	uint32_t wakeUpCounter;
	uint32_t wakeUpClock;

	if (ms <= 32000) {
		// Up to 32 seconds: use RTCCLK/16 (2048 Hz, ~0.49 ms resolution)
		wakeUpClock   = RTC_WAKEUPCLOCK_RTCCLK_DIV16;
		wakeUpCounter = (ms << 11) / 1000;  // ms * 2048 / 1000
		if (wakeUpCounter < 2) {
			wakeUpCounter = 2;
		}
		if (wakeUpCounter > 0xFFFF) {
			wakeUpCounter = 0xFFFF;
		}
	} else {
		// Over 32 seconds: use CK_SPRE (1 Hz, 1 second resolution)
		wakeUpClock   = RTC_WAKEUPCLOCK_CK_SPRE_16BITS;
		wakeUpCounter = ms / 1000;
		if (wakeUpCounter == 0) {
			wakeUpCounter = 1;
		}
		if (wakeUpCounter > 0xFFFF) {
			wakeUpCounter = 0xFFFF;  // Max ~18 hours
		}
	}

#if defined(STM32WLxx)
	// Clear wakeup flag (WUTE + WUTIE) for STM32WL
	HAL_RTCEx_DeactivateWakeUpTimer(&hrtc);
#endif

	if (HAL_RTCEx_SetWakeUpTimer_IT(&hrtc, wakeUpCounter, wakeUpClock, 0) != HAL_OK) {
		return false;
	}

#else
	// ============================================================
	// STM32F2/F3/F4/F7/L1/L4/L5/G0/G4/H7: Use wake-up timer
	// ============================================================

	uint32_t wakeUpCounter;
	uint32_t wakeUpClock;

	if (ms <= 32000) {
		// Up to 32 seconds: use RTCCLK/16 (2048 Hz, ~0.49 ms resolution)
		wakeUpClock = RTC_WAKEUPCLOCK_RTCCLK_DIV16;
		wakeUpCounter = (ms << 11) / 1000;  // ms * 2048 / 1000
		if (wakeUpCounter < 2) {
			wakeUpCounter = 2;
		}
		if (wakeUpCounter > 0xFFFF) {
			wakeUpCounter = 0xFFFF;
		}
	} else {
		// Over 32 seconds: use CK_SPRE (1 Hz, 1 second resolution)
		wakeUpClock = RTC_WAKEUPCLOCK_CK_SPRE_16BITS;
		wakeUpCounter = ms / 1000;
		if (wakeUpCounter == 0) {
			wakeUpCounter = 1;
		}
		if (wakeUpCounter > 0xFFFF) {
			wakeUpCounter = 0xFFFF;  // Max ~18 hours
		}
	}

	if (HAL_RTCEx_SetWakeUpTimer_IT(&hrtc, wakeUpCounter, wakeUpClock) != HAL_OK) {
		return false;
	}

#endif // STM32F1xx

	return true;
}

/**
 * @brief Restore system clock after wake-up from STOP mode
 * @note After STOP mode, system clock defaults to HSI (8 MHz on F1, 16 MHz on F4).
 *       SystemClock_Config() restores the full PLL configuration.
 */
static void hwSleepRestoreSystemClock(void)
{
	SystemClock_Config();
}

/**
 * @brief ISR for wake-up interrupt 1
 */
static void wakeUp1ISR(void)
{
	_wokeUpByInterrupt = _wakeUp1Interrupt;
}

/**
 * @brief ISR for wake-up interrupt 2
 */
static void wakeUp2ISR(void)
{
	_wokeUpByInterrupt = _wakeUp2Interrupt;
}

/**
 * @brief RTC interrupt handlers
 */
#if defined(STM32F1xx)
extern "C" void RTC_Alarm_IRQHandler(void)
{
	// Lean handler: clear flags directly instead of going through HAL
	EXTI->PR = EXTI_PR_PR17;         // Clear EXTI line 17 pending
	RTC->CRL &= ~RTC_CRL_ALRF;      // Clear RTC alarm flag
}
#elif defined(STM32U0xx)
// STM32U0: Combined RTC/TAMP interrupt (no separate RTC_WKUP vector)
extern "C" void RTC_TAMP_IRQHandler(void)
{
	HAL_RTCEx_WakeUpTimerIRQHandler(&hrtc);
}
#elif defined(STM32WLxx)

#if defined(CORE_CM0PLUS)  // Dual processor STM32WL
extern "C" void RTC_LSECSS_IRQHandler(void)
#else
extern "C" void RTC_WKUP_IRQHandler(void)
#endif
{
	HAL_RTCEx_WakeUpTimerIRQHandler(&hrtc);
}
extern "C" void HAL_RTCEx_WakeUpTimerEventCallback(RTC_HandleTypeDef * /* hrtc */)
{
	/* intentionally empty – wake-up is the only action needed */
}

#else
extern "C" void RTC_WKUP_IRQHandler(void)
{
	HAL_RTCEx_WakeUpTimerIRQHandler(&hrtc);
}
#endif

// ======================== Public Sleep Functions ========================

uint32_t hwGetSleepRemaining(void)
{
	return sleepRemainingMs;
}

/**
 * @brief Common sleep implementation
 * @param interrupt1 First interrupt pin (INVALID_INTERRUPT_NUM = none)
 * @param mode1 First interrupt mode
 * @param interrupt2 Second interrupt pin (INVALID_INTERRUPT_NUM = none)
 * @param mode2 Second interrupt mode
 * @param ms Sleep duration in ms (0 = interrupt-only, no timer)
 * @return Wake-up source or error code
 */
static int8_t hwSleepInternal(const uint8_t interrupt1, const uint8_t mode1,
                              const uint8_t interrupt2, const uint8_t mode2,
                              uint32_t ms)
{
	bool hasInterrupt = (interrupt1 != INVALID_INTERRUPT_NUM) ||
	                    (interrupt2 != INVALID_INTERRUPT_NUM);

	// Reject timer-only sleep with ms=0 (would sleep forever with no wake source)
	if (ms == 0 && !hasInterrupt) {
		return MY_SLEEP_NOT_POSSIBLE;
	}

	// Initialize RTC if needed
	if (!rtcInitialized) {
		if (!hwSleepInit()) {
			return MY_SLEEP_NOT_POSSIBLE;
		}
	}

	// Configure RTC wake-up timer (if ms > 0)
	if (ms > 0) {
		if (!hwSleepConfigureTimer(ms)) {
			return MY_SLEEP_NOT_POSSIBLE;
		}
	}

	// Reset sleep state
	sleepRemainingMs = 0ul;
	_wokeUpByInterrupt = INVALID_INTERRUPT_NUM;

	// Attach interrupt wake-up sources
	if (hasInterrupt) {
		_wakeUp1Interrupt = interrupt1;
		_wakeUp2Interrupt = interrupt2;

		MY_CRITICAL_SECTION {
			if (interrupt1 != INVALID_INTERRUPT_NUM)
			{
				attachInterrupt(digitalPinToInterrupt(interrupt1), wakeUp1ISR, mode1);
			}
			if (interrupt2 != INVALID_INTERRUPT_NUM)
			{
				attachInterrupt(digitalPinToInterrupt(interrupt2), wakeUp2ISR, mode2);
			}
		}

		// Check if an interrupt already fired between attach and here
		if (_wokeUpByInterrupt != INVALID_INTERRUPT_NUM) {
			// Already woken — skip sleep, go to cleanup
			goto cleanup;
		}
	}

	// Record RTC counter before sleep (for sleepRemaining calculation)
	{
		const uint32_t sleepStartCounter = hwRtcGetCounter();

		// Clear all wake-up flags before entering STOP mode
#if defined(STM32F1xx)
		RTC->CRL &= ~RTC_CRL_ALRF;
		// Configure EXTI line 17 for RTC Alarm wake-up from STOP mode
		// Without EXTI, the alarm flag is set but the CPU does not wake
		EXTI->IMR |= EXTI_IMR_MR17;     // Unmask EXTI line 17
		EXTI->RTSR |= EXTI_RTSR_TR17;   // Rising edge trigger
		EXTI->PR = EXTI_PR_PR17;
		NVIC_ClearPendingIRQ(RTC_Alarm_IRQn);
#else
		__HAL_RTC_WAKEUPTIMER_CLEAR_FLAG(&hrtc, RTC_FLAG_WUTF);
#endif
		__HAL_PWR_CLEAR_FLAG(PWR_FLAG_WU);

		// Suspend SysTick to prevent 1ms interrupts during sleep
		HAL_SuspendTick();

		// Enter STOP mode with low-power regulator
		// NOTE: USB CDC will disconnect (expected; USB needs system clock)
		HAL_PWR_EnterSTOPMode(PWR_LOWPOWERREGULATOR_ON, PWR_STOPENTRY_WFI);

		// ================================================================
		// === MCU is in STOP mode here, waiting for wake-up event ===
		// ================================================================

		// Restore system clock (HSI -> PLL)
		hwSleepRestoreSystemClock();

