mysensors/MySensors/hal/architecture/STM32/MyHwSTM32.cpp
		// Resume SysTick
		HAL_ResumeTick();

		// Clear wake-up flags after wake
#if defined(STM32F1xx)
		RTC->CRL &= ~RTC_CRL_ALRF;
		EXTI->PR = EXTI_PR_PR17;
#else
		__HAL_RTC_WAKEUPTIMER_CLEAR_FLAG(&hrtc, RTC_FLAG_WUTF);
		HAL_RTC_WaitForSynchro(&hrtc);
#endif
		__HAL_PWR_CLEAR_FLAG(PWR_FLAG_WU);

		// Calculate sleep remaining
		if (ms > 0) {
			const uint32_t sleepEndCounter = hwRtcGetCounter();
			uint32_t elapsedSeconds;

#if defined(STM32F1xx)
			elapsedSeconds = sleepEndCounter - sleepStartCounter;
#else
			// Handle midnight rollover (86400 seconds in a day)
			if (sleepEndCounter >= sleepStartCounter) {
				elapsedSeconds = sleepEndCounter - sleepStartCounter;
			} else {
				elapsedSeconds = (86400 - sleepStartCounter) + sleepEndCounter;
			}
#endif

			const uint32_t elapsedMs = elapsedSeconds * 1000;
			sleepRemainingMs = (elapsedMs < ms) ? (ms - elapsedMs) : 0;
		}
	}

cleanup:
	// Detach interrupts
	if (interrupt1 != INVALID_INTERRUPT_NUM) {
		detachInterrupt(digitalPinToInterrupt(interrupt1));
	}
	if (interrupt2 != INVALID_INTERRUPT_NUM) {
		detachInterrupt(digitalPinToInterrupt(interrupt2));
	}

	// Disable wake-up timer
	if (ms > 0) {
#if defined(STM32F1xx)
		HAL_RTC_DeactivateAlarm(&hrtc, RTC_ALARM_A);
#else
		HAL_RTCEx_DeactivateWakeUpTimer(&hrtc);
#endif
	}

	// Determine wake-up source
	int8_t ret = MY_WAKE_UP_BY_TIMER;
	if (_wokeUpByInterrupt != INVALID_INTERRUPT_NUM) {
		ret = (int8_t)_wokeUpByInterrupt;
	}

	// Reset interrupt tracking
	_wokeUpByInterrupt = INVALID_INTERRUPT_NUM;
	_wakeUp1Interrupt = INVALID_INTERRUPT_NUM;
	_wakeUp2Interrupt = INVALID_INTERRUPT_NUM;

	return ret;
}

int8_t hwSleep(uint32_t ms)
{
	return hwSleepInternal(INVALID_INTERRUPT_NUM, 0, INVALID_INTERRUPT_NUM, 0, ms);
}

int8_t hwSleep(const uint8_t interrupt, const uint8_t mode, uint32_t ms)
{
	return hwSleepInternal(interrupt, mode, INVALID_INTERRUPT_NUM, 0, ms);
}

int8_t hwSleep(const uint8_t interrupt1, const uint8_t mode1,
               const uint8_t interrupt2, const uint8_t mode2, uint32_t ms)
{
	return hwSleepInternal(interrupt1, mode1, interrupt2, mode2, ms);
}
